cask_args appdir: '/Applications'
tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'd12frosted/emacs-plus'

brew 'git', args: ['HEAD']
brew 'fish'
brew 'hub'
brew 'pyenv'
brew 'mas'
brew 'fzf'
brew 'python'
brew 'htop'
brew 'emacs-plus', args: ['with-cocoa', 'with-gnustl', 'with-librsvg', 'with-imagemagick']
brew 'gnu-tar'

cask 'iterm2-beta'
cask 'alfred'
cask 'google-chrome-canary'
cask 'google-chrome'
cask 'vivaldi-snapshot'
cask 'java' unless system '/usr/libexec/java_home --failfast'
